of60/tutorials/rheoFoam/OtherTests/tube_GNF/CarreauYasuda/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type            CarreauYasuda;
                
                rho             rho   [1 -3 0 0 0 0 0] 1050;
                eta0            eta0   [ 1 -1 -1 0 0 0 0 ] 0.056; 
   		etaInf          etaInf  [ 1 -1 -1 0 0 0 0 ] .00345; 
   		k               k     [ 0 0 1 0 0 0 0 ] 1.902; 
   		n               n     [ 0 0 0 0 0 0 0 ] 0.22;   
   		a               a     [ 0 0 0 0 0 0 0 ] 1.25;
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
